In [43]:
import pandas as pd 
import numpy as np
Task3=pd.read_csv("data47.csv")
Task3

TypeError: 'Index' object is not callable

In [2]:
Task3.replace(["a","b","c"],[0,0,0],inplace=True)

In [3]:
Task3["num1"]=Task3["num1"].astype(np.int)
Task3["num2"]=Task3["num2"].astype(np.int)

C:\Users\dbda\AppData\Local\Temp\ipykernel_6184\4171275821.py:1: DeprecationWarning: `np.int` is a deprecated alias for the builtin `int`. To silence this warning, use `int` by itself. Doing this will not modify any behavior and is safe. When replacing `np.int`, you may wish to use e.g. `np.int64` or `np.int32` to specify the precision. If you wish to review your current use, check the release note link for additional information.
Deprecated in NumPy 1.20; for more details and guidance: https://numpy.org/devdocs/release/1.20.0-notes.html#deprecations
  Task3["num1"]=Task3["num1"].astype(np.int)
C:\Users\dbda\AppData\Local\Temp\ipykernel_6184\4171275821.py:2: DeprecationWarning: `np.int` is a deprecated alias for the builtin `int`. To silence this warning, use `int` by itself. Doing this will not modify any behavior and is safe. When replacing `np.int`, you may wish to use e.g. `np.int64` or `np.int32` to specify the precision. If you wish to review your current use, check the release note link for additional information.
Deprecated in NumPy 1.20; for more details and guidance: https://numpy.org/devdocs/release/1.20.0-notes.html#deprecations
  Task3["num2"]=Task3["num2"].astype(np.int)

In [4]:
Task3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   num1    8 non-null      int32
 1   num2    8 non-null      int32
dtypes: int32(2)
memory usage: 192.0 bytes

In [5]:
Task3["sum"]=Task3["num1"]+Task3["num2"]
Task3["avg"]=(Task3["num1"]+Task3["num2"])/2

Task3

   num1  num2  sum   avg
0    10    20   30  15.0
1    30    40   70  35.0
2    50     0   50  25.0
3    60    70  130  65.0
4    80     0   80  40.0
5    90    15  105  52.5
6     0    25   25  12.5
7    10    15   25  12.5

In [33]:
T4=pd.read_csv(r"C:\Users\dbda\Desktop\ML-ashok\data48.csv")
T4
T4.fillna(0,inplace=True)
T4

    num1  num2
0   10.0  20.0
1   30.0  40.0
2   50.0   0.0
3   60.0  70.0
4   80.0   0.0
5   90.0  15.0
6    0.0  25.0
7   10.0  15.0
8   11.0   0.0
9    0.0   0.0
10  25.0   5.0
11   0.0   0.0
12   0.0   0.0
13  11.0  12.0

In [34]:
T4["sum"]=T4["num1"]+T4["num2"]

In [35]:
T4

    num1  num2    sum
0   10.0  20.0   30.0
1   30.0  40.0   70.0
2   50.0   0.0   50.0
3   60.0  70.0  130.0
4   80.0   0.0   80.0
5   90.0  15.0  105.0
6    0.0  25.0   25.0
7   10.0  15.0   25.0
8   11.0   0.0   11.0
9    0.0   0.0    0.0
10  25.0   5.0   30.0
11   0.0   0.0    0.0
12   0.0   0.0    0.0
13  11.0  12.0   23.0

In [36]:
T4["avg"]=(T4["sum"])/2

In [37]:
T4

    num1  num2    sum   avg
0   10.0  20.0   30.0  15.0
1   30.0  40.0   70.0  35.0
2   50.0   0.0   50.0  25.0
3   60.0  70.0  130.0  65.0
4   80.0   0.0   80.0  40.0
5   90.0  15.0  105.0  52.5
6    0.0  25.0   25.0  12.5
7   10.0  15.0   25.0  12.5
8   11.0   0.0   11.0   5.5
9    0.0   0.0    0.0   0.0
10  25.0   5.0   30.0  15.0
11   0.0   0.0    0.0   0.0
12   0.0   0.0    0.0   0.0
13  11.0  12.0   23.0  11.5

In [11]:
T5=pd.read_csv(r"C:\Users\dbda\Desktop\ML-ashok\task5.csv",sep="[ ]+")
T5

C:\Users\dbda\AppData\Local\Temp\ipykernel_6184\3250376356.py:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  T5=pd.read_csv(r"C:\Users\dbda\Desktop\ML-ashok\task5.csv",sep="[ ]+")

   name   dept
0  ravi  sales
1  manu  purch
2  hari  accts

In [12]:
T5

   name   dept
0  ravi  sales
1  manu  purch
2  hari  accts

In [13]:
T5.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   dept    3 non-null      object
dtypes: object(2)
memory usage: 176.0+ bytes

In [14]:
data1={
    "name":["ravi","manu","hari"],
    "dept":["sales","purch","accts"]
}
data1

{'name': ['ravi', 'manu', 'hari'], 'dept': ['sales', 'purch', 'accts']}

In [15]:
T5

   name   dept
0  ravi  sales
1  manu  purch
2  hari  accts

In [25]:
dumines=pd.get_dummies(T5["dept"])
dumines

   accts  purch  sales
0      0      0      1
1      0      1      0
2      1      0      0

In [27]:
dumines1=pd.get_dummies(T5["name"])
dumines1

   hari  manu  ravi
0     0     0     1
1     0     1     0
2     1     0     0

In [31]:
result=pd.concat([T5["name"],dumines],axis=1)
result

   name  accts  purch  sales
0  ravi      0      0      1
1  manu      0      1      0
2  hari      1      0      0

In [42]:
dumines1

TypeError: 'Index' object is not callable

In [47]:
T5_mapping={'sales':1,'purch':2,'accts':3}
T5_mapping

{'sales': 1, 'purch': 2, 'accts': 3}

In [48]:
T5['dept_numeric']=T5['dept'].map(T5_mapping)
T5

   name   dept  dept_numeric
0  ravi  sales             1
1  manu  purch             2
2  hari  accts             3

In [46]:
T5result=T5[['name','dept_numeric']]

In [49]:
T5result

   name  dept_numeric
0  ravi             1
1  manu             2
2  hari             3

In [ ]:
---------------------------TASK6--------------------------------------------

In [54]:
data={
    'name':['ravi','manu','hari','ranjan'],
    'dept':['sales','purch','accts','finan']
}

data

{'name': ['ravi', 'manu', 'hari', 'ranjan'],
 'dept': ['sales', 'purch', 'accts', 'finan']}

In [57]:
T6=pd.DataFrame(data)
T6

     name   dept
0    ravi  sales
1    manu  purch
2    hari  accts
3  ranjan  finan

In [58]:
T6['name']

0      ravi
1      manu
2      hari
3    ranjan
Name: name, dtype: object

In [62]:
T6['name']=T6['name'].str.upper()
T6

     name   dept
0    RAVI  sales
1    MANU  purch
2    HARI  accts
3  RANJAN  finan

In [65]:
T6['name']=T6['name'].apply(lambda x: x[0].upper())
T6

  name   dept
0    R  sales
1    M  purch
2    H  accts
3    R  finan

In [89]:
T6_1=pd.DataFrame(data)
T6_1

     name   dept
0    ravi  sales
1    manu  purch
2    hari  accts
3  ranjan  finan

In [90]:
T6_1['name']=T6_1['name'].apply(lambda x: x[0].upper() + x[1:-1].lower()+ x[-1].upper())
T6_1

     name   dept
0    RavI  sales
1    ManU  purch
2    HarI  accts
3  RanjaN  finan

  name   dept
0   RR  sales
1   MM  purch
2   HH  accts
3   RR  finan

In [ ]:
-----------------------------------------------TASK-7--------------------------------------------------------

In [84]:
T7=pd.read_csv('fullname.csv' , sep="[-]")
T7

C:\Users\dbda\AppData\Local\Temp\ipykernel_6184\1185364322.py:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  T7=pd.read_csv('fullname.csv' , sep="[-]")

    fullname
a b        c
x y        z
p q        r

In [81]:
T7[['first', 'mid', 'last']] = T7['fullname'].str.split('-', expand=True)

In [82]:
T7

  fullname first mid last
0   a-b-c      a   b   c
1    x-y-z     x   y    z
2    p-q-r     p   q    r